BellerageHackathon/src/DataProcessors/РабочееМестоАдминистратора/РабочееМестоАдминистратора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
<name>РабочееМестоАдминистратора</name><synonym><key>ru</key><value>Центр тестирования</value></synonym></mdclass:DataProcessor>

BellerageHackathon/src/Catalogs/Тесты/Тесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тесты</name>
  <attributes>
    <name>ИдентификаторТеста</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпубликованнаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАрхивации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаАрхивации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/DataProcessors/РабочееМестоАдминистратора/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
    Запрос = Новый Запрос("ВЫБРАТЬ Ссылка, Наименование, Статус, РабочаяВерсия, ОпубликованнаяВерсия ИЗ Справочник.Тесты ГДЕ НЕ ПометкаУдаления УПОРЯДОЧИТЬ ПО Наименование");
    ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "Тесты");
    Сводка = "Тестов: " + Строка(Тесты.Количество()) + ". Создайте тест, настройте вопросы в черновике и опубликуйте версию.";
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
    ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТест(Команда)
    Ссылка = СоздатьНаСервере();
    ОбновитьНаСервере();
    ОткрытьФорму("Справочник.Тесты.Форма.ФормаЭлемента", Новый Структура("Ключ", Ссылка), ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция СоздатьНаСервере()
    Возврат РабочееМестоТестированияСервер.СоздатьТест();
КонецФункции

&НаКлиенте
Процедура ОткрытьТест(Команда)
    Строка = Элементы.Тесты.ТекущиеДанные;
    Если Строка = Неопределено Тогда Возврат; КонецЕсли;
    ОткрытьФорму("Справочник.Тесты.Форма.ФормаЭлемента", Новый Структура("Ключ", Строка.Ссылка), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Результаты(Команда)
    ОткрытьФорму("Документ.РезультатПопытки.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Отчет(Команда)
    ОткрытьФорму("Отчет.РезультатыТестирования.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура Обмен(Команда)
    ОткрытьФорму("Справочник.СообщенияОбмена.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
    ОткрытьФорму("Обработка.НастройкиИнтеграции.Форма.Форма");
КонецПроцедуры
